1 #  მომხმარებელს შემოატანინეთ სახელი და გვარი, რასაც შემდეგ გადაუვლით 
# for loop-ით და შემოტანილი სახელისა და გვარის თითოეულ ასოს ცალ-ცალკე გამოიტანთ ტერმინალში;

full_name = input("enter your name and surname: ")

for i in full_name:
    print(i)



2 #  მომხმარებელს შემოატანინეთ რიცხვი და დაბეჭდეთ ამ რიცხვის თითოეული ციფრი;

num1 = float("enter number: ")
for i in num1:
    print(i)



3 #  მომხმარებელს შემოატანინეთ რიცხვი და დაბეჭდეთ რიცხვები მომხმარებლის
# შემოტანილი რიცხვიდან 0-მდე. (მაგ. input = 3. output: 3 2 1 );

num1 = int(input("enter number: "))

for i in range(num1, -1, -1):
    print(i, end=" ")



4 # კომენტარის სახით ახსენით თუ როგორ მუშაობს for loop-ი;

# for loop ციკლი გვაძლევს საშუალებას გავაკეთოთ ერთი და იგივე მაგალითი რამდენჯერმე, 
# ასევე შეიგიძლია გამოიტანო რიცხვი მაგ: 1-5 ამდე და ა.შ
# რას აკეთებს for: for გამოიყენეაბა ზუსტად ამისთვის რაიმე მაგალითის რამდენჯერმე გამოსაყენებლად
# რას აკეთებეს range: range ქმნის რიცხვების რიგს სადაც აკეთებს მოქმედებას კონკრეტულ რიცხვებზე



5 #  კომენტარის სახით განმარტეთ თუ რას ნიშნავს საიტერაციო ცვლადი.

# საიტერაციო ცვლადი არის ცვლადი რომლეიც გამოიყენება for loop ის დროს და შეიცავს მიმდინარე რიცხვს


