1 # ცვლადში შეინახეთ თქვენი სახელი. შემდეგ ინდექსინგის მეშვეობით ეკრანზე გამოიტანეთ სტრინგიდან
# ყველა ის ასო,რომელიც არის ხმოვანი.

name = "nika"
for letter in name:  
    if letter in "aeiou":  
        print(letter)  




2 #  True or False? Strings are mutable, Lists are immutable.

# False




3 # ახსენით თუ რატომ არის სწორი/არასწორი მეორე დავალებაში მოცემული წინადადება.

# იმიტომ რომ  სტრინგი არის შეუცვლელი,ეს იმას ნიშნავს რომროდესაც სტრინგს შექმნი მისი შეცვლა აღარ შეიძლება,
# ხოლო სიაში შეგვიძლია,ამოვიღოთ ელემენტები,დავამატოთ და ა.შ




4 # ცვლადში შეინახეთ ცარიელი სია. input-ის მეშვეობით მომხმარებელს შემოატანინეთ ინფორმაცია საკუთარი თავის შესახებ. 
# (მაგ. სახელი, გვარი, ასაკი, დაბადების თარიღი, სიმაღლე და ა.შ.)მომხმარებელმა მინიმუმ უნდა შემოიტანოს
#  8 input. ეს ყოველივე input დაამატეთ თქვენს მიერ შექმნილ ცარიელ სიაში.
user_info = []

user_info.append(input("Enter your first name: "))
user_info.append(input("Enter your last name: "))
user_info.append(input("Enter your age: "))
user_info.append(input("Enter your date of birth: "))
user_info.append(input("Enter your height: "))
user_info.append(input("Enter your phone number: "))
user_info.append(input("Enter your favorite music : "))
user_info.append(input("Enter your favorite film: "))

print(user_info)





5 #  დაასრულეთ საკლასო დავალებები. (ეცადეთ თქვენით გააკეთოთ სანამ ჩანაწერს გადახედავთ ):

 # • მომხმარებელს შემოატანინეთ 10 მნიშვნელობა სიაში (For loop-ის მეშვეობით. ) შემდეგ გამოიყენეთ კიდევ ერთი for loop, 
 # გადაუარეთ თითოეულ სიის ელემენტს და შამოწმეთ ეს რიცხვები ლუწია თუ კენტი.

# • მომხმარებელს შემოატანინეთ 5 სახეთი, შემდეგ კი კიდევ ერთი for loop გამოიყენეთ რათა გაიგოთ ამ სახელებში სიმბოლოების რაოდენობა 
# აღემატება თუ არა 5-ს. თუ აღემატება დაუბეჭდეთ "the name consists of more than five letters).

# • შექმენით სია, რომელშიც დაამატებთ ჯანსაღ საკვებ პროდუქტებს. (იყოს მინიმუმ 5 პროდუქტი). ამოშალეთ სიის პირველი და ბოლო 
# ელემენტები და ტერმინალში დაბეჭდეთ სიის განახლებული ვერსია. 

# • შექმენით რიცხვების სია, რომელშიც მინიმუმ გექნებათ 5 ელემენტი. ამ 5 ელემენტიდან 1 განსხვავებული ელემენტი იქნება.
#  ეს ელემენტი უნდა იყოს მოთავსებული დაახლოების სიის შუაში. (არ უნდა იყოს სიის დასაწყისში ან დასასრულში).
#  თქვენი დავალებაა დაწეროთ პროგრამა და იპოვოთ ეს განსხვავებული ელემენტი მოცემულ სიაში. (მინიშნება: სიის დალაგება)

# გაკეთებული მაქვს