1 # თქვენი სიტყვებით ახსენით თუ რაში გვჭირდება ფუნქციების გამოყენება პითონში.

# როდესაც პითონში ფუნქციებს ვიყენებთ ,კოდში უფრო მცირე შეცდომები გვაქ, თავს ვარიდებთ 
# კოდების გამეორებას და კოდი უფრო გასაგები და ლამაზი


2 # გადახედეთ რესურსს პითონში ფუნქციების შესახებ:


3 #  შექმენით ფუნქცია სახელწოდებით double_values რომელიც არგუმენტად მიიღებს სიას და დააბრუნებს 
# ახალ სიას, სადაც თითოეული ელემენტი გაორმაგებული იქნება.

def double_values(list):
   return [x * 2 for x in list]


4 # შექმენით ფუნქცია, რომელსაც არგუმენტად გადასცემთ სიას (ჩათვალეთ, რომ სიაში ინახება Integer-ი რიცხვები). 
# ამ ფუნქციამ საბოლოოდ უნდა დააბრუნოს სიიდან მხოლოდ ლუწი რიცხვები.

def even_numbers(list):
    return [x for x in list if x % 2 == 0]


5 #  შექმენით ფუნქცია და გადაეცით არგუმენტად სია. ფუნქციამ უნდა დააბრუნოს ახალი სია,
# რომლის თითოეული ელემენტიც უნდა იყოს კვადრატში აყვანილი.

def square_numbers(list):
    return [x ** 2 for x in list]



6 #  შექმენით ფუნქცია და არგუმენტად გადაეცით String-ი.ფუნქციამ ეგრედწოდებულად უნდა "გაფილტროს" 
# ეს სტრინგი თანხმოვანი ასოებისგან და მხოლოდდააბრუნოს ის ხმოვანი ასოები, რომლებსაც ეს სტრინგი შეიცავს.

def filter(word):
    vowels = "aeiou"
    result = ""

    for char in word:
        if char in vowels:
            result += char
    
    return result


filter("Nika")



7 # შექმენით ფუნქცია და გადაეცით რიცხვების სია არგუმენტად. ფუნქციის მიზანი იქნება, რომ სიიდან დააბრუნოს მხოლოდ უარყოფითი რიცხვები.

def filter_positive(numbers):
    negative_numbers = []

    for number in numbers:
        if number < 0:
            negative_numbers.append(number)
    
    return negative_numbers

filter_positive([1,2,3,-5,-8,-10,7,11])





8 #  წინა დავალების ანალოგიურად შექმენით ფუნქცია და გადაეცით რიცხვების სია არგუმენტად. ამ შემთხვევაში ფუნქციის მიზანი
# იქნება, რომ სიიდან დააბრუნოს მხოლოდ დადებითი რიცხვები.

def positive_numbers(list):
    return [x for x in list if x > 0]




9 # 
def math_operation(number):
    return (number ** 2) * 10




10 #  შექმენით ფუნქცია. მას გადაეცით ორი პარამეტრი: x და y რიცხვები. ფუნქციამ უნდა დააბრუნოს x რიცხვი აყვანილი y ხარისხში.

def raise_to_power(x, y):
    return x ** y

