# 2 ტერმინალში გაშვების გარეშე დაადგინეთ თუ რას გამოიტანს მოცემული კოდი:
True and False or False or True and False
# ბოლოს კი გაუშვით ეს კოდი და შეამოწმეთ თქვენი ვარაუდი გამართლდა თუ არა.

# ეს გამოიტანს false, დიახ გამართლდა


3 # დაწერეთ პროგრამა, რომელიც მომხმარებელს მოსთხოვს რიცხვის შემოტანას.
# თუ შემოტანილი რიცხვი ლუწია და  მეტია ათზე დაბეჭდოს "True".
# სხვა შემთხვევაში, დაბეჭდოს "False".


num1 = float(input("please enter number:"))

if num1 >=  10:
    print("True")
else:
    print("False")



4 #  გადახედეთ რესურსებში ჩაგდებულ მასალას for loop-ების შესახებ.



5 # თქვენი სიტყვებით ახსენით თუ როგორ მუშაობს for loop.

# for loop ციკლი გვაძლევს საშუალებას გავაკეთოთ ერთი და იგივე მაგალითი რამდენჯერმე, 
# ასევე შეიგიძლია გამოიტანო რიცხვი მაგ: 1-5 ამდე და ა.შ
# რას აკეთებს for: for გამოიყენეაბა ზუსტად ამისთვის რაიმე მაგალითის რამდენჯერმე გამოსაყენებლად
# რას აკეთებეს range: range ქმნის რიცხვების რიგს სადაც აკეთებს მოქმედებას კონკრეტულ რიცხვებზე



6 # დაწერეთ for loop, რომელიც დაბეჭდავს რიცხვებს 1-დან 15-ის ჩათვლით.

for i in range (1, 16):
    print(i)



7 #  დაწერეთ for loop, რომელიც 1-დან 10-მდე ყველა რიცხვის ჯამს გამოთვლის.

sum = 0
for i in range (1, 10):
    sum =+i
print(i)



8 #  გადახედეთ გაკვეთილის ჩანაწერს.