1 # დაწერეთ პითონის პროგრამა, რომელშიც შექმნით 2 ცვლადს სახელად num1 და num2, შეინახეთ მათში რიცხვები,
# საბოლოოდ კი  print ის გამოყენებით დაბეჭდეთ ამ ორი ცვლადის ჯამს

num1 = 10
num2 = 90

print (num1 + num2)


2 # შექმენით პრეზენტაცია სადაც ახსნით რა არის compiler, interpered and compiled ენებს შორის განსხვავებას, 
# რა არის ცვლადები (ნებისმიერი პრეზენტაციის პროგრამის გამოყენებით)







3 # (bonus - აუცილებელი არაა ამის გაკეთება, უბრალოდ ვტესტავთ თქვენს უნარებს)  შექმენით პროგრამა სადაც მომხმარებელს
# input ფუნქციის საშუალებით შემოატანინებთ თავის ასაკს, შემდეგ ეს ასაკი გარდაქმენით მთელ რიცხვად 
# (რადგან შემოტანილი რიცხვი სტრინგის ფორმატში იქნება თავიდან), საბოლოოდ კი if else_ის საშუალებით დაბეჭდეთ შესაბამისი ტექსტები,
# თუ მომხმარებლის ასაკი >= 18 დაბეჭდეთ რომ ის არის ზრდასრული, სხვაშემთხვევაში დაუბეჭდეთ რომ ის არის არასრულწლოვანი



age = input("enter your age: ")
age = int(age)
if age >= 18:
    print("you are adult")
else:
    print("you are not an adult")